# Билет 32

# Задание 1

# Задание 2

<img src="img/32_2.jpg" width=1000>

In [10]:
import pandas as pd

In [11]:
def show_na(df: pd.DataFrame):
    numeric_cols = df.select_dtypes(exclude=[object]).columns
    cnt = df[numeric_cols].isna().sum()
    print(cnt[cnt != 0])

In [12]:
df = pd.read_csv('data/task_2/titanic.csv', sep=',')
show_na(df)
df.head()

Age    177
dtype: int64

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
# способ 1
numeric_cols = df.select_dtypes(exclude=[object]).columns
df[numeric_cols] = df.groupby(['Pclass', 'Sex'])[numeric_cols].transform(lambda x: x.fillna(x.mean()))
show_na(df)
df.head()

Series([], dtype: int64)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
# способ 2
numeric_cols = df.select_dtypes(exclude=[object]).columns
df = df.fillna(df.groupby(['Pclass', 'Sex'])[numeric_cols].transform('mean'))
show_na(df)
df.head()

Series([], dtype: int64)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Задание 3

<img src="img/32_2.jpg" width=1000>

In [15]:
import h5py
import dask.array as da

In [16]:
arr = da.from_array(h5py.File('data/task_3/random.hdf5')['data_set_1'])

In [19]:
mean = arr.mean()
std = arr.std()
n = da.sum(arr > (mean + 3 * std))
(n / arr.size).compute()

0.00135003